<a href="https://colab.research.google.com/github/Nutsudapenpong/DPDM/blob/master/HRR.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas

In [2]:
import pandas as pd

In [3]:
from google.colab import drive

In [4]:
drive.mount('/content/drive')

Mounted at /content/drive

In [5]:
import os

In [6]:
base_path = '/content/drive/My Drive/DM_Exam2020'

In [7]:
os.listdir(base_path)

['reduced_marketbasket (2).csv',
 'search_click (1).csv',
 'w_restaurant (1).csv',
 'search_request (1).csv',
 'metadata (1).xlsx']

In [8]:
request = os.path.join(base_path, 'search_request (1).csv')
click = os.path.join(base_path, 'search_click (1).csv')
restaurant = os.path.join(base_path, 'w_restaurant (1).csv')

In [9]:
request_name = pd.read_csv(request)

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (7,8,9) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [10]:
click_name = pd.read_csv(click)

In [11]:
restaurant_name = pd.read_csv(restaurant)

In [12]:
request_name

          Unnamed: 0                             search_id  ...      lat     long
0                  0  683de889-f923-494e-9d46-44a3d67b7259  ...  12.6347  101.463
1                  1  4a811230-ffa4-4631-a4c8-5d0394137d02  ...  14.8009  102.534
2                  2  7ad6ee8e-438e-4bea-9183-74dcef9e358e  ...  13.7383  100.371
3                  3  0c17a5f5-fa89-40f4-ae94-a8659268f827  ...  12.6669  101.861
4                  4  6870dc3a-5602-44fc-80ed-df0a7783df9d  ...  12.2372    99.88
...              ...                                   ...  ...      ...      ...
10004352    10005225  5d8c10aa-63cf-4bdd-ab01-0af17a98781f  ...      NaN      NaN
10004353    10005226  66cc94db-217a-4d8e-aa20-b1d10e17c968  ...      NaN      NaN
10004354    10005227  4eb3b514-fb71-4dfe-a580-c560e8c9dcc7  ...      NaN      NaN
10004355    10005228  f5554532-2eb1-4ba6-a98e-1e10b2174d2c  ...      NaN      NaN
10004356    10005229  48421ba4-8c69-46a5-aa05-425ddc82a09a  ...      NaN      NaN

[10004357 rows x 10 columns]

In [13]:
request_re = request_name.iloc[:,1:3]

In [14]:
request_re

                                     search_id         search_timestamp
0         683de889-f923-494e-9d46-44a3d67b7259  2018-06-14 12:34:35.449
1         4a811230-ffa4-4631-a4c8-5d0394137d02  2018-06-14 17:11:19.469
2         7ad6ee8e-438e-4bea-9183-74dcef9e358e  2018-06-14 13:22:31.736
3         0c17a5f5-fa89-40f4-ae94-a8659268f827  2018-06-02 12:37:27.331
4         6870dc3a-5602-44fc-80ed-df0a7783df9d  2018-06-02 11:19:22.404
...                                        ...                      ...
10004352  5d8c10aa-63cf-4bdd-ab01-0af17a98781f  2018-06-24 09:23:57.777
10004353  66cc94db-217a-4d8e-aa20-b1d10e17c968  2018-06-24 17:03:39.908
10004354  4eb3b514-fb71-4dfe-a580-c560e8c9dcc7  2018-06-24 19:17:55.797
10004355  f5554532-2eb1-4ba6-a98e-1e10b2174d2c  2018-06-24 16:53:06.067
10004356  48421ba4-8c69-46a5-aa05-425ddc82a09a  2018-06-24 18:06:58.441

[10004357 rows x 2 columns]

In [34]:
click_re = click_name.iloc[:,1:4]

In [35]:
click_re

                    click_timestamp  ... business_id
0        2018-06-15 05:11:38.914154  ...    298839.0
1        2018-06-15 06:30:51.277476  ...    171372.0
2        2018-06-15 06:32:09.558025  ...     16157.0
3        2018-06-15 06:00:59.820390  ...     89741.0
4        2018-06-15 05:23:36.828525  ...    189564.0
...                             ...  ...         ...
7882032  2018-06-28 01:59:10.893735  ...     16614.0
7882033  2018-06-28 01:59:11.085196  ...     16614.0
7882034  2018-06-28 06:49:02.493141  ...     19569.0
7882035  2018-06-28 06:36:02.865507  ...    227719.0
7882036  2018-06-28 06:20:35.249050  ...    316442.0

[7882037 rows x 3 columns]

In [36]:
restaurant_re = restaurant_name.iloc[:,1:2]

In [37]:
restaurant_re

            id
0            2
1            4
2            5
3            6
4            7
...        ...
246842  340068
246843  340070
246844  340074
246845  340079
246846  340091

[246847 rows x 1 columns]

In [38]:
merged_table = request_re.merge(click_re,how='left',left_on='search_id',right_on='search_id')
merged_table

                                     search_id  ... business_id
0         683de889-f923-494e-9d46-44a3d67b7259  ...         NaN
1         4a811230-ffa4-4631-a4c8-5d0394137d02  ...         NaN
2         7ad6ee8e-438e-4bea-9183-74dcef9e358e  ...         NaN
3         0c17a5f5-fa89-40f4-ae94-a8659268f827  ...         NaN
4         6870dc3a-5602-44fc-80ed-df0a7783df9d  ...         NaN
...                                        ...  ...         ...
12551165  66cc94db-217a-4d8e-aa20-b1d10e17c968  ...         NaN
12551166  4eb3b514-fb71-4dfe-a580-c560e8c9dcc7  ...         NaN
12551167  f5554532-2eb1-4ba6-a98e-1e10b2174d2c  ...         NaN
12551168  48421ba4-8c69-46a5-aa05-425ddc82a09a  ...    336953.0
12551169  48421ba4-8c69-46a5-aa05-425ddc82a09a  ...    184664.0

[12551170 rows x 4 columns]

In [39]:
merged2_table = merged_table.merge(restaurant_re,how='left',left_on='business_id',right_on='id')
merged2_table

                                     search_id  ...        id
0         683de889-f923-494e-9d46-44a3d67b7259  ...       NaN
1         4a811230-ffa4-4631-a4c8-5d0394137d02  ...       NaN
2         7ad6ee8e-438e-4bea-9183-74dcef9e358e  ...       NaN
3         0c17a5f5-fa89-40f4-ae94-a8659268f827  ...       NaN
4         6870dc3a-5602-44fc-80ed-df0a7783df9d  ...       NaN
...                                        ...  ...       ...
12551165  66cc94db-217a-4d8e-aa20-b1d10e17c968  ...       NaN
12551166  4eb3b514-fb71-4dfe-a580-c560e8c9dcc7  ...       NaN
12551167  f5554532-2eb1-4ba6-a98e-1e10b2174d2c  ...       NaN
12551168  48421ba4-8c69-46a5-aa05-425ddc82a09a  ...  336953.0
12551169  48421ba4-8c69-46a5-aa05-425ddc82a09a  ...  184664.0

[12551170 rows x 5 columns]

In [40]:
merged2_table.isnull()

          search_id  search_timestamp  click_timestamp  business_id     id
0             False             False             True         True   True
1             False             False             True         True   True
2             False             False             True         True   True
3             False             False             True         True   True
4             False             False             True         True   True
...             ...               ...              ...          ...    ...
12551165      False             False             True         True   True
12551166      False             False             True         True   True
12551167      False             False             True         True   True
12551168      False             False            False        False  False
12551169      False             False            False        False  False

[12551170 rows x 5 columns]

In [41]:
merged2_table.isnull().any()

search_id           False
search_timestamp    False
click_timestamp      True
business_id          True
id                   True
dtype: bool

In [42]:
merged2_table.isnull().any().any()

True

In [43]:
merged2_table_nm = merged2_table.dropna()

In [44]:
((merged2_table.shape[0] - merged2_table_nm.shape[0] )*100)/merged2_table.shape[0]

64.72359150581181